// pages/news/news.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    "colorName":["ca","cb","cc","cd"],
    article:[
      {
        "content":"踏上跑道，是一种选择。离开起点，是一种勇气。驰骋赛场，是一种胜利。运动健将们，用你的"
        + "实力，用你的精神，去开拓出，一片属于你的长跑天地！"
      },
      {
        "content":"不为刹那的荣耀，只有执着的信念，化作不停的奔跑，心中燃烧着梦想，"
        + "你用行动述说着过程的重要，没有无尽的终点，没有无法攀登的险峰，希望载着终点在"
        + "向你微笑，拼搏吧！经历是一种精彩，迸发你全部的能量，成功是你汗水的写照。"
      },
      {
        "content":"虽然你们在场上的时间很短暂，但你们的身影依然停留在人们的脑海里，因为你们是赛场上最可爱"
        + "的人，不为掌声的注释，不为刻意的征服，不为失败的痛苦，只有辛勤的汗水化作成功的脚步。"
      },
      {
        "content":"坚定，执着，耐力与希望，在延伸的白色跑道中点点凝聚！力量，信念，拼搏与奋斗，在遥远的终"
        + "点线上渐渐明亮！时代的强音正在你的脚下踏响。"
      },
      {
        "content":"青春的脚步，青春的速度，青春的活力，青春的激情，将会在你们的身上尽情体现。迎接自我，挑"
        + "战自我，战胜自我！我们相信你们一定能行，加油吧，运动员！终点就在眼前！"
      },
      {
        "content":"汗水，泪水；笑声，歌声；我们尽情挥洒。开幕式上，运动场上，我们尽情展现，多少艰辛，多少" +
        "困苦，我们勇敢承担。因为年轻，因为张扬，因为我们知道：用今天的汗水换来明天的微笑。"
      },
      {
        "content":"心中坚定的信念，脚下沉稳的步伐，你用行动告诉我们一个不变之理，没有走不完的路，没有过不"
        + "了的山，成功正在终点冲着你高高的招手，用你那顽强的意志去努力，去迎接终点的鲜花与掌声，"
        + "相信成功一定是属于你。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})